import matplotlib.pyplot as plt

# qsort
plt.xlabel('Количество элементов массива')
plt.ylabel('Время в секундах')
plt.plot([1, 10, 50, 100, 200, 300, 400, 500, 600, 700, 800, 900, 1000], [0.000001, 0.000002, 0.000008, 0.000016, 0.000038, 0.000043,\
    0.000048, 0.000056, 0.000060, 0.000071, 0.000083, 0.000107, 0.000122], 'ro')
plt.axis([0, 1100, 0, 0.02])
plt.show()

# mysort
plt.xlabel('Количество элементов массива')
plt.ylabel('Время в секундах')
plt.plot([1, 10, 50, 100, 200, 300, 400, 500, 600, 700, 800, 900, 1000], [0.000002, 0.000003, 0.000043, 0.000159, 0.000609, 0.001518,\
    0.002562, 0.004036, 0.005311, 0.006646, 0.007192, 0.010079, 0.016389], 'ro')
plt.axis([0, 1100, 0, 0.02])
plt.show()
